app/controllers/libraries_controller.rb

SELECT * FROM "libraries"
---
  def catalogxml
    @libraries = Library.all